# Pandas 动手学入门
本课程基于[DataWhale开源教程《Joyful-Pandas》](http://joyfulpandas.datawhale.club/index.html)与[开源项目 ajcr/100-pandas-puzzles](https://github.com/ajcr/100-pandas-puzzles)其[中译版](https://github.com/VXenomac/100-pandas-puzzles-cn)开发. 在数据分析的实践中，Pandas是一个非常重要的库，它集成了非常多的统计分析功能，[《Joyful-Pandas》](http://joyfulpandas.datawhale.club/index.html)是一份非常详尽，并且适合新手的Pandas中文教程，同时它也是Pandas官方认证的中文教程！但笔者学习过程中，始终觉得编程学习“纸上得来终觉浅”，对于刚接触一个新的库的“躬行”笔者认为最好的方式就是对照着官方文档以及QuickStart吧例子自己尝试一遍，并且在实践中学会如何查文档，这是一个开发者必备的技能.因此本教程就是基于这样的思想，给出对应的操作以及对应的文档地址，学习者需要自行查阅文档，完成下面的实践.

## 餐前准备
在这部分中，我们主要学习如何导入Pandas以及查看版本信息，难度是比较简单的.
> 请你阅读Joyful-Pandas第二章，完成下方练习.
http://joyfulpandas.datawhale.club/Content/ch2.html

**1.** 以 `pd` 别名导入 pandas 库

**2.** 打印出pandas 库的版本信息

**3.** 打印 pandas 依赖包及其版本信息

## 备齐食材
在这部分中，主要介绍了Pandas一个重要的数据结构```DataFrame```

> 请你阅读Joyful-Pandas第二章，完成下方练习.
http://joyfulpandas.datawhale.club/Content/ch2.html

**4.** 使用数据 `data` 和行索引 `labels` 创建一个 DataFrame `df`

In [ ]:
import numpy as np

有下面这样的一个数据字典 `data` 以及列表格式的标签数据 `labels`:

In [19]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**5.** 显示该 DataFrame 及其数据相关的基本信息（*提示：DataFrame 直接调用的方法*）

**6.** 返回 DataFrame `df` 的前4行数据

**7.** 从 DataFrame `df` 选择标签为 `animal` 和 `age` 的列

**8.** 在 `[3, 4, 8]` 行中，列为 `['animal', 'age']` 的数据

**9.** 选择列```visits``` 大于 3 的行

**10.** 选择 `age` 为缺失值的行

**11.** 选择 `animal` 是cat且`age` 小于 3 的行

**12.** 选择 `age` 在 2 到 4 之间的数据（包含边界值）

**13.** 将 'f' 行的 `age` 改为 1.5

**14.** 对 `visits` 列的数据求和

**15.** 计算每种 `animal` `age` 的平均值

**16.** 新增一行数据 k，数据自定义，然后再删除新追加的 k 行

**17.** 统计每种 `animal` 的个数

**18.** 先根据 `age` 降序排列，再根据 `visits` 升序排列（结果 `i` 列在前面，`d` 列在最后面）

**19.** 将 `priority` 列的 `yes` 和 `no` 用 `True` 和 `False` 替换

**20.** 将 `animal` 列的 `snake` 用 `python` 替换

**21.** 对于每种 `animal` 和 `visit`，求出平均年龄。换句话说，每一行都是动物，每一列都是访问次数，其值是平均年龄（提示：使用数据透视表）

**22.** 读取`data`文件夹下的`boston.csv`文件，并尝试利用上面的方法自行分析，得出一些简单的结论.

至此，相信你已经可以通过阅读文档，掌握了pandas中`DataFrame`的一些基本操作，下面我们来讲点更进一步的操作，它是上述这些操作的一些巧妙结合

## 食材搭配
在这个部分中，我们主要介绍对于DataFrame中的数据的一些操作：去重、数据计算、取值······
> 请你阅读Joyful-Pandas第二章，完成下方练习. http://joyfulpandas.datawhale.club/Content/ch2.html

In [12]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

**23.** 请用pandas操作输出上面的`df`中`A`列出现的元素的唯一值（即：出现过的所有元素的集合）

**24.** 输出`df`中的唯一值及其对应出现的频数

**25.** 将`df`进行数据降重

**26.** 给定一组随机数据

In [13]:
df = pd.DataFrame(np.random.random(size=(5, 3))) 
df

          0         1         2
0  0.440698  0.450417  0.497289
1  0.212835  0.256508  0.425047
2  0.749474  0.302770  0.042028
3  0.937908  0.850558  0.000373
4  0.672270  0.195581  0.493469

使每个元素减去所在行的平均值？

**27.** 返回下列`df`数字总和最小那列的标签

In [14]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.022006,0.633789,0.636726,0.924794,0.631662,0.551937,0.676674,0.263256,0.963895,0.649127
1,0.403560,0.848327,0.969231,0.276738,0.957184,0.924642,0.275507,0.307531,0.601491,0.550660
2,0.318511,0.050677,0.119048,0.889077,0.191811,0.843565,0.688219,0.135905,0.454032,0.547381
3,0.734349,0.117874,0.331031,0.416920,0.523379,0.578376,0.577580,0.262208,0.834598,0.846100
4,0.302562,0.844408,0.420430,0.726060,0.498297,0.761697,0.274890,0.720648,0.912308,0.753593

**28.** 计算一个 DataFrame 有多少不重复的行？

In [15]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
df

   0  1  2
0  0  1  0
1  1  0  0
2  1  1  1
3  1  0  0
4  1  1  0
5  1  0  0
6  1  1  1
7  0  1  1
8  0  1  0
9  0  1  0

**29.** DataFrame 数据如下，A 和 B 都是 0-100 之间（包括边界值）的数值，对 A 进行分段分组（i.e. (0, 10], (10, 20], ...），求每组内 B 的和。输出应该和下述一致：
```
A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
```

In [17]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, 
                  size=(100, 2)), 
                  columns = ["A", "B"])
df

     A   B
0   46  29
1   75  22
2   49  63
3   33  43
4   71  75
..  ..  ..
95  60  87
96  57  40
97  86  19
98  50  56
99  97  94

[100 rows x 2 columns]

## 用pandas进行数据清洗
下面的`df`是我们用到的数据集

In [10]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**30.**  **FlightNumber**列中的某些值缺失（它们是NaN）。这些数字是有规律的，即每行增加 10，因此`NaN`需要放置 10055 和 10075。修改`df`以填充这些缺失的数字并使该列成为整数列（而不是浮点列）

**31.** **From_To**列作为两个单独的列会更好！拆分下划线分隔符`_`前后的每个字符串. 将其拆分成两列，存放在一个名为“temp”的临时 DataFrame，将列名 'From' 和 'To' 分配给这个临时DataFrame.

**32.** 注意城市名称的大小写是混合在一起的。标准化字符串，以便只有第一个字母是大写的（例如“londON”应该变成“London”。）

**33.** 将`From_To`列从`df`中删去，将`temp`处理好的数据合并到`df`中

**34.**在`AirLine`列中，您可以看到航空公司名称周围出现了一些额外的符号。只提取航空公司名称。例如'(British Airways. )'应该变成'British Airways'.

**35.** 在 RecentDelays 列中，值已作为列表输入到 DataFrame 中。我们希望每个第一个值在它自己的列中，每个第二个值在它自己的列中，依此类推。如果没有第 N 个值，则该值应为 NaN。

将 Series 列表展开为名为 的 DataFrame delays，重命名列delay_1，delay_2等等，并将不需要的 RecentDelays 列替换df为delays